<template>
  <div class="MemberBenefits">
    <div class="title">
      <h1>會員權益</h1>
      <span>MEMBER BENEFITS</span>
    </div>
    <el-card class="MemberBenefits_content">
      <div class="MemberBenefits_content_header">
        <div
          :class="activeStatus == index ? 'active' : ''"
          v-for="(item, index) in dataFormList"
          :key="index"
          @click="titleClick(index)"
          v-html="item.title"
        ></div>
      </div>
      <div class="MemberBenefits_content_content">
        <!-- {{ dataFormList[activeStatus].content }} -->
        <!-- 會員VIP -->
        <div v-if="activeStatus == 0">
          <h2>淨水管家VIP服務專屬權益</h2>
          <h2>
            秉持「全方位守護您的居家飲水健康」的理念，從安裝淨水器前的專業水質評估，到個人化濾心保養服務，期望提供給消費者最完整且專業的淨水器服務旅程。
          </h2>
          <h1>一、尊榮獨享</h1>
          <p>1.濾心保養服務管道更多元</p>
          <p>2.最新活動訊息 淨水會員獨享點數回饋</p>
          <p>3.專屬授權通路 專屬個人化服務</p>
          <p>4.櫻花服務4.0 水質健檢</p>
          <p>透過回函登錄櫻花淨水器系列產品，即可享有上述相關售後服務權益</p>
          <p>專屬櫻花淨水管家LINE@個人化服務綁定，申請服務與活動訊息最即時。</p>
          <h1>二、櫻花點數商城</h1>
          <p>
            目前櫻花淨水管家開放使用點數商城，多項兌換品項將陸續上架，給予會員更多專屬好康。
          </p>
          <p>一、最新活動</p>
          <p>櫻花將不定期舉辦會員專屬活動，透過每一次的活動來累積點數。</p>
          <p>二、兌換商城</p>
          <p>
            兌換品項需以點數換取，兌換成功時，將由專人親自送至府上，讓您享有專屬禮遇。
          </p>
          <p>三、兌換紀錄</p>
          <p>您可以隨時查閱自己所兌換過的品項，清楚記錄自己的會員好禮清單。</p>
        </div>
        <!-- 會員VIP -->
        <!-- 個人資料 -->
        <div v-if="activeStatus == 1">
          <h3>
            一、本公司(台灣櫻花股份有限公司)因回函卡業務而蒐集、處理或利用之個人資料時，皆以尊重您的權益為基礎，並以誠實信用之方式及以下原則為之。
          </h3>
          <h3>
            二、本公司蒐集您個人資料之目的係因產品回函卡所有服務、行銷、統計調查與分析或資訊與資料庫管理之執行，凡依規定辦理與推廣活動之行為皆屬之。本公司僅會請您提供為回函卡之執行而必要之個人資料，包含姓名、出生年月日與聯絡方式等個人資料類別。
          </h3>
          <h3>
            三、本公司蒐集您之個人資料只會在服務契約成立前階段、契約存續期間或經您同意之期間被處理或利用，惟相關法令另有保存期限規定者從其之。您的個人資料原則上僅會以電子檔或紙本形式於我國台澎金馬等中華民國所轄境內宮本公司與本公司之委外廠商處理及利用。若您需要更近一步了解您的個人資料之處理或利用的詳細情形，歡迎您與我們聯繫。
          </h3>
          <h3>
            四、本公司對於蒐集、處理或利用任何之個人資料皆以遵循本公司之個人資料管理目標與政策為指導原則，並訂有完善之個人資料檔案安全維護計畫，任何流程皆有嚴格之管控程序及標準作業流程，您可以安心的將您的個人資料提供予本公司。
          </h3>
          <h3>
            五、本公司保有您的個人資料時，基於個人資料保護法規定，您可以行使下述的權利：
            <span>(1)查詢或請求閱覽您的個人資料。</span>
            <span>(2)請求製給您的個人資料複製本。</span>
            <span>(3)請求補充或更正您的個人資料。</span>
            <span>(4)請求停止蒐集、處理或利用您的個人資料。</span>
            <span>(5)請求刪除您的個人資料</span>
            <span
              >※您欲行使上述提及之相關權利時，本公司的服務聯繫窗口能受理您的需求。</span
            >
            <span
              >※您可以在本公司官方網站(網址：https://www.sakura.com.tw/)上找到聯繫我們的在電話號碼、電子郵件信箱。</span
            >
          </h3>
          <h3>
            六、本公司基於上述原因需蒐集、處理或利用您的個人資料時，您可以自由選擇是否提供您的個人資料。若您選擇不提供個人資料或是提供不完全時，基於健全回函卡業務之執行，本公司將可能無法提供您完善的服務(如：維修、安檢等服務)。
          </h3>
          <h3>
            七、本公司將於法令規定前提下，不定期更新或變更相關資訊，相關資訊以更新後者為準。
          </h3>
        </div>
        <!-- 個人資料 -->
        <!-- 相關說明 -->
        <div v-if="activeStatus == 2">
          <h4>
            Q1：點數獲得要件為何?
            <em
              >說明：點數獲得條件將依照每一次的會員活動辦法有所不同，並依台灣櫻花股份有限公司官方網站公告之辦法為累積點數原則。</em
            >
          </h4>
          <h4>
            Q2：點數可以換成現金嗎?
            <em>說明：不可以，當前的點數機制尚無規劃能夠兌換等價貨幣。</em>
          </h4>
          <h4>
            Q3：點數能夠轉讓嗎?
            <em
              >說明：不可以，所有的點數回饋皆歸戶於同一個消費者名義底下，無法轉讓。</em
            >
          </h4>
          <h4>
            Q4：我的點數有期限嗎?
            <em
              >說明：一年期間點數未異動(新增或兌換)，點數將全數歸零，若在一年內異動時，歸零週期將以異動當日起重新計算。</em
            >
          </h4>
          <h4>
            Q5：點數會因為我的淨水器異動而有影響嗎?
            <em
              >說明：因為點數是依據個人的消費者資料做紀錄，因此您若遇到淨水器轉移給其他親友使用，或是辦理退貨時，您所累積的點數將不會遭清除。</em
            >
          </h4>
          <h4>
            Q6：若自己並沒有購買淨水器，但卻是櫻花的客戶，有辦法累積點數嗎?
            <em
              >說明：目前櫻花點數商城的相關機制皆適用於「淨水管家」當中，因此您仍可以使用部分功能，但點數會依據每一次活動條件而篩選累積資格(請參閱Q1)。</em
            >
          </h4>
        </div>
        <!-- 相關說明 -->
        <!-- 建議說明 -->
        <div v-if="activeStatus == 3">
          <h2>親愛的用戶：</h2>
          <p>
            您好!感謝您選用櫻花淨水系列商品，根據您家中的飲用水需求及居住區域的水質狀況等資料，為您計算出您家中專屬的濾心週期規畫建議書，提醒您每道濾心的最佳更換週期，以維護您家中的飲水品質，讓府上喝水更安心。
          </p>
          <h5>
            本公司提供三項濾心更換週期提醒機制，完整把關您的居家飲水健康：
          </h5>
          <h3>
            1.總部原廠服務人員
            <span
              >依據您家中更換濾心的週期，客服人員將事先與您電話聯絡約定到府時間，再由受過專業訓練的服務人員至您家中更換濾心。</span
            >
          </h3>
          <h3>
            2.指定通路濾心保養服務
            <span
              >若由櫻花授權的指定店家為您銷售及安裝淨水器，未來的濾心到期提醒與保養更換皆由該店家為您服務。</span
            >
          </h3>
          <h3>
            3.自行保養更換
            <span
              >當您的淨水器完成回函登錄以後，並且與櫻花淨水管家LINE@進行個人化綁定，您將會定期收到濾心保養通知，您可以選擇上述的專人保養服務，亦可自行保養更換。(無法適用機型P018、P022、P022B、P031、P0310S、P0552、P0622、P0622C、P082、P0852、P0880、P0882。)</span
            >
          </h3>
          <h6>
            有了淨水器，必須定期更換濾心，才能真正確保家中飲用水的純淨。櫻花建議您由專業的服務人員定期到府更換濾心，才能享有最完善的服務，讓您輕輕鬆鬆喝好水!
          </h6>
          <h6>注意事項：</h6>
          <p>
            1.若沒有指定的通路店家為您處理濾心保養服務，將由總部原廠服務人員為您服務。(您亦可親自致電至客服中心確認您的濾心保養服務)
          </p>
          <p>2.若選擇自行保養更換時，請確認以下步驟：</p>
          <p>2-1.更換濾心前，必須關閉進水三通球閥。</p>
          <p>
            2-2.濾心上是否有製造編號，並且再次確認型號與淨水器濾心道數是否一致。
          </p>
          <p>2-3.透過淨水管家「自行保養更換」完成所需步驟。</p>
          <p>2-4.將舊濾心拆下後，置換新的濾心即更換完成。</p>
          <p>
            3.建議濾心更換週期並不是指濾心的品質保證期，而是濾心保持其原有性能的預計週期。
          </p>
          <p>
            4.在水質不良的地區或用水較頻繁的情況下，可縮短濾心的更換週期，此時需要提前更換濾心。
          </p>
          <p>5.建議府上每半年清洗家中水塔，以延長淨水器濾心使用壽命。</p>
          <p>
            6.若您府上安裝RO機型，若產生阻塞造成無法出水狀況，需立即更換RO膜。
          </p>
          <p>7.如有疑問請隨時致電客服中心0800-021818。</p>
        </div>
        <!-- 建議說明 -->
      </div>
    </el-card>
  </div>
</template>

<script>
export default {
  name: "MemberBenefits",
  data() {
    return {
      activeStatus: 0,
      dataFormList: [
        {
          title: "會員VIP<br />權益說明",
          content:
            "本團隊尊重用戶隱私權，為了讓您更加清楚使用時如何同意、提供、莧集個人有關資料予服務團隊，請詳閱隱私權政策.本文件將告知您有關權益，以及我們的隱私權政策.未來會持續更新並公告於官網中本團隊尊重用戶隱私權，為了讓您更加清楚使用時。如何同意、提供、萬集個人有關資料予服務團隊，請詳閱隱私權政策，本文件將告知您有關權益，以及我們的隱私權政策，未來會持續更新並公告於官網中用戶隱私權，為了讓您更加清楚使用時如何同意、提供、莧集個人有關資料予服務團隊，請詳閱隱私權政策.本文件將告知您有關權益.以及我們的隱私權政策↓未來會持續更新並公告於官網中。"
        },
        {
          title: "個人資料<br />注意事項",
          content:
            "個人資料注意事項本團隊尊重用戶隱私權，為了讓您更加清楚使用時如何同意、提供、莧集個人有關資料予服務團隊，請詳閱隱私權政策.本文件將告知您有關權益，以及我們的隱私權政策.未來會持續更新並公告於官網中本團隊尊重用戶隱私權，為了讓您更加清楚使用時。如何同意、提供、萬集個人有關資料予服務團隊，請詳閱隱私權政策，本文件將告知您有關權益，以及我們的隱私權政策，未來會持續更新並公告於官網中用戶隱私權，為了讓您更加清楚使用時如何同意、提供、莧集個人有關資料予服務團隊，請詳閱隱私權政策.本文件將告知您有關權益.以及我們的隱私權政策↓未來會持續更新並公告於官網中。"
        },
        {
          title: "點數商城<br />相關說明",
          content:
            "櫻花點數商城辦法聲明本團隊尊重用戶隱私權，為了讓您更加清楚使用時如何同意、提供、莧集個人有關資料予服務團隊，請詳閱隱私權政策.本文件將告知您有關權益，以及我們的隱私權政策.未來會持續更新並公告於官網中本團隊尊重用戶隱私權，為了讓您更加清楚使用時。如何同意、提供、萬集個人有關資料予服務團隊，請詳閱隱私權政策，本文件將告知您有關權益，以及我們的隱私權政策，未來會持續更新並公告於官網中用戶隱私權，為了讓您更加清楚使用時如何同意、提供、莧集個人有關資料予服務團隊，請詳閱隱私權政策.本文件將告知您有關權益.以及我們的隱私權政策↓未來會持續更新並公告於官網中。"
        },
        {
          title: "濾心更換<br />建議說明",
          content:
            "濾心更換建議書本團隊尊重用戶隱私權，為了讓您更加清楚使用時如何同意、提供、莧集個人有關資料予服務團隊，請詳閱隱私權政策.本文件將告知您有關權益，以及我們的隱私權政策.未來會持續更新並公告於官網中本團隊尊重用戶隱私權，為了讓您更加清楚使用時。如何同意、提供、萬集個人有關資料予服務團隊，請詳閱隱私權政策，本文件將告知您有關權益，以及我們的隱私權政策，未來會持續更新並公告於官網中用戶隱私權，為了讓您更加清楚使用時如何同意、提供、莧集個人有關資料予服務團隊，請詳閱隱私權政策.本文件將告知您有關權益.以及我們的隱私權政策↓未來會持續更新並公告於官網中。"
        }
      ]
    };
  },
  methods: {
    titleClick(index) {
      this.activeStatus = index;
    }
  }
};
</script>

<style scoped lang="scss">
@import "../../assets/styles/mixin.scss";
.MemberBenefits {
  .title {
    margin-bottom: 4rem;
    text-align: center;
    color: #fff;
    h1 {
      line-height: 4.4rem;
      font-size: 3.1rem;
      font-weight: lighter;
    }
    span {
      line-height: 1.7rem;
      font-size: 1.2rem;
      font-weight: lighter;
    }
  }
  .MemberBenefits_content {
    .MemberBenefits_content_header {
      display: flex;
      div {
        width: 25%;
        text-align: center;
        font-size: 1.6rem;
        color: rgba(134, 134, 134, 1);
        line-height: 2rem;
        font-weight: 600;
        padding: 1rem 0;
        border-bottom: 1px solid #eeeeee;
      }
      .active {
        border-bottom: 1px solid #252427;
        font-weight: 600;
        color: rgba(37, 36, 39, 1);
      }
    }
    .MemberBenefits_content_content {
      padding: 2.5rem;
      font-size: 1.4rem;
      color: rgba(61, 61, 61, 1);
      line-height: 2.5rem;
      h2 {
        line-height: 2rem;
        margin-bottom: 1rem;
      }
      h6 {
        line-height: 2rem;
        margin-bottom: 1rem;
        padding-left: 1.2rem;
      }
      h1 {
        margin-top: 2rem;
        margin-bottom: 1rem;
        font-weight: bold;
      }
      p {
        line-height: 2rem;
        padding-left: 1.2rem;
      }
      // a {
      //   display: block;
      //   line-height: 2rem;
      //   text-indent: 1em;
      //   color: blue;
      // }
      h3 {
        margin-bottom: 1rem;
        line-height: 2.2rem;
        font-weight: bold;
        span {
          display: block;
          line-height: 2.2rem;
          padding-left: 1.2rem;
          font-weight: normal;
        }
      }
      h4 {
        margin-bottom: 1rem;
        line-height: 2.2rem;
        font-weight: bold;
        em {
          display: block;
          line-height: 2.2rem;
          font-weight: normal;
        }
      }
      h5 {
        margin-top: 1rem;
        margin-bottom: 1rem;
      }
    }
  }
  @media screen and (min-width: 992px) and (max-width: 1200px) {
  }
  @media screen and (max-width: 991px) {
    .MemberBenefits_content {
      .MemberBenefits_content_header {
        div {
          font-size: 1.3rem;
          line-height: 1.8rem;
        }
      }
      .MemberBenefits_content_content {
        padding: 2rem 0;
      }
    }
  }
}
</style>
